dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "../BSP/stm32f429i_discovery.h"
#include "../BSP/stm32f429i_discovery_lcd.h"
#include "../BSP/stm32f429i_discovery_ts.h"
#include <math.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

RNG_HandleTypeDef hrng;

SPI_HandleTypeDef hspi5;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart5;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
osThreadId commTaskHandle;
osThreadId sensorTaskHandle;
osThreadId controlTaskHandle;
osThreadId servoRampTaskHandle;
osThreadId tsTaskHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define LCD_FRAME_BUFFER_LAYER0                  (LCD_FRAME_BUFFER+0x130000)
#define LCD_FRAME_BUFFER_LAYER1                  LCD_FRAME_BUFFER
#define F32_PI 3.1415927

typedef struct 
{
  float X;
  float Y;
} XYCoordinates;

typedef struct 
{
  float joint1Angle;
  float joint2angle;
} JointAngles;

static volatile float horLinkLength = 0.15;
static volatile float verLinkLength = 0.135;

static volatile float horLinkAngle = 45;
static volatile float verLinkAngle = 45;
static volatile float turnAngle = 0;

static volatile float dutyCycle2DegFactor = 17.0;

static volatile float servo1NewPosRef = 7.5; // forgato 8.2 a valodi kozep
static volatile float servo2NewPosRef = 8.8;  // vizszintes
static volatile float servo3NewPosRef = 3.9;   // fuggoleges
static volatile float servo4NewPosRef = 11.25; // megfogo
static volatile float servo5NewPosRef = 7.5;

static volatile float servo1NewPos = 7.5;
static volatile float servo2NewPos = 10; 
static volatile float servo3NewPos = 3.7;
static volatile float servo4NewPos = 7.5;
static volatile float servo5NewPos = 7.5;

static volatile float servo1CurrPos = 7.5;
static volatile float servo2CurrPos = 8.8; 
static volatile float servo3CurrPos = 3.9;
static volatile float servo4CurrPos = 11.25;
static volatile float servo5CurrPos = 7.5;

static volatile float servo1Min = 2.5;
static volatile float servo2Min = 6.5;
static volatile float servo3Min = 3.7;
static volatile float servo4Min = 5;
static volatile float servo5Min = 5;

static volatile float servo1Max = 12.5;
static volatile float servo2Max = 11.5;
static volatile float servo3Max = 8.3;
static volatile float servo4Max = 11.3;
static volatile float servo5Max = 10;



static volatile float servo1StepSize = 0.014;
static volatile float servo2StepSize = 0.024;
static volatile float servo3StepSize = 0.024;
static volatile float servo4StepSize = 0.024;
static volatile float servo5StepSize = 0.024;

static volatile int mode = 0;
static volatile int cycleRepeat = 0;
static volatile int graphicsEna =1;

char txBuf[30];
char rxBuf[20];
uint8_t receiveState = 0;

Point verLinkPoints[4];
Point horLinkPoints[4];

XYCoordinates coordinates;
JointAngles calculatedAngles;
/* USER CODE END PV */

