dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
}

/* USER CODE BEGIN 4 */
void saturateFloat(volatile float* i, float min, float max) {
  float val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}

float absfloat(float num){
  if (num < 0) return (num*-1);
  else return num;
}

float deg2rad(float deg){
  float rad = 0;
  rad = (deg * F32_PI) / 180.0;
  return rad;
}

float rad2deg(float rad){
  float deg = 0;
  deg = (rad * 180) / F32_PI;
  return deg;
}

float deg2dc(float angleDeg) {
  float dc = 0;
  dc = (180-angleDeg)/dutyCycle2DegFactor;
  return dc;
}

float dc2deg(float dc) {
  float angleDeg = 0;
  angleDeg = 180 - (dc * dutyCycle2DegFactor);
  return angleDeg;
}

float receivedTurn2dc(uint16_t turnNumber){
  return (turnNumber/20.0 + 2.5);
}

float dc2turnDeg(float dc){
  return ((dc - 7.5)*9);
}

float receivedGrip2dc(uint16_t gripValue){
  return (gripValue/16.0 + 5.0);
}

XYCoordinates calculateForwardKinematics(float joint1Angle, float joint2Angle){
  
  coordinates.X = verLinkLength * cosf(deg2rad(joint1Angle)) + horLinkLength * cosf(deg2rad(joint2Angle));
  coordinates.Y = verLinkLength * sinf(deg2rad(joint1Angle)) - horLinkLength * sinf(deg2rad(joint2Angle));
  
  return coordinates;
}

JointAngles calculateInverseKinematics(float xPos, float yPos){
  
  static volatile float x_temp;
  static volatile float y_temp;
  static float c;
  static float gamma;
  static float alpha;
  static float beta;
  static float epsilon;
  static float delta;
  static float omega;
  
  x_temp = xPos;
  y_temp = yPos;
  
  c = sqrtf(xPos*xPos + yPos*yPos); //c^2=a^2+b^2
  gamma = asinf(yPos/c);
  alpha = acosf((verLinkLength*verLinkLength + c*c - horLinkLength*horLinkLength)/(2*verLinkLength*c));
  
  calculatedAngles.joint1Angle = rad2deg(gamma + alpha);
  
  beta = acosf((verLinkLength*verLinkLength + horLinkLength*horLinkLength - c*c)/(2*verLinkLength*horLinkLength));
  epsilon = 90 - rad2deg(gamma + alpha);
  delta = 90 - epsilon;
  omega = 180 - delta - rad2deg(beta);
  
  calculatedAngles.joint2angle = omega;
  
  return calculatedAngles;
}

/**
   * @brief Count characters in char array
	 * @param ptr: pointer to char array
   * @retval Number of characters in array
   */
uint16_t SizeofCharArray(char *ptr)
{
  /* Local variables */
  uint16_t len = 0;
  
  /* Search until end char */
  while (ptr[len] != '\0') {   
    len++;
  }	
  return len;
}
/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_DEVICE */
  MX_USB_DEVICE_Init();

  /* USER CODE BEGIN 5 */
  int elapsedTime = 0;
  char textBuf[30];
  float verLinkAngleAfterRefresh = 0;
  float horLinkAngleAfterRefresh = 0;
  float turnAngleAfterRefresh = 0;
  
  XYCoordinates endPoint;
  //JointAngles finalJointAngles;
  
  
  /* Infinite loop */
  for(;;)
  {
    if ((BSP_PB_GetState(BUTTON_KEY) == SET) && (elapsedTime > 10)){
      //mode++;
      //cycleRepeat = 1;
      cycleRepeat ^= 1;
      BSP_LCD_DisplayChar(5,25,(char)(cycleRepeat+48));
      elapsedTime = 0;
    }
    
    if (elapsedTime < 100){
      elapsedTime+=1;
    }
    
    verLinkAngle = dc2deg(servo3CurrPos);
    horLinkAngle = dc2deg(servo2CurrPos);
    turnAngle    = dc2turnDeg(servo1CurrPos);
    
    sprintf(textBuf, "V joint: %.2f deg",  verLinkAngle);
    BSP_LCD_DisplayStringAt(5, 45, (unsigned char*) textBuf, LEFT_MODE);
    sprintf(textBuf, "H joint: %.2f deg",  horLinkAngle);
    BSP_LCD_DisplayStringAt(5, 60, (unsigned char*) textBuf, LEFT_MODE);
    
    
    endPoint = calculateForwardKinematics(verLinkAngle,horLinkAngle);
    
    sprintf(textBuf, "X: %.1f cm", (endPoint.X*100));
    BSP_LCD_DisplayStringAt(5, 75, (unsigned char*) textBuf, LEFT_MODE);
    sprintf(textBuf, "Y: %.1f cm", (endPoint.Y*100));
    BSP_LCD_DisplayStringAt(5, 90, (unsigned char*) textBuf, LEFT_MODE);
    
    if (((verLinkAngleAfterRefresh != verLinkAngle) || (horLinkAngleAfterRefresh != horLinkAngle) || (turnAngleAfterRefresh != turnAngle)) && (graphicsEna)) {
      BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
      BSP_LCD_FillRect(5,135,230,180);
      BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
      
      verLinkAngleAfterRefresh = verLinkAngle;
      horLinkAngleAfterRefresh = horLinkAngle;
      turnAngleAfterRefresh    = turnAngle;
      
      verLinkPoints[0].X = 45;
      verLinkPoints[0].Y = 250;
      verLinkPoints[1].X = verLinkPoints[0].X + 10;
      verLinkPoints[1].Y = verLinkPoints[0].Y;
      
      verLinkPoints[3].X = (int16_t)(verLinkPoints[0].X + (74.25*cosf(deg2rad(verLinkAngle))));
      verLinkPoints[3].Y = (int16_t)(verLinkPoints[0].Y - (74.25*sinf(deg2rad(verLinkAngle))));
      verLinkPoints[2].X = verLinkPoints[3].X + 10;
      verLinkPoints[2].Y = verLinkPoints[3].Y;
      
      horLinkPoints[0].X = verLinkPoints[2].X;
      horLinkPoints[0].Y = verLinkPoints[2].Y;
      horLinkPoints[1].X = verLinkPoints[2].X;
      horLinkPoints[1].Y = verLinkPoints[2].Y + 10;
      
      horLinkPoints[3].X = (int16_t)(horLinkPoints[0].X + (82.5*cosf(deg2rad(horLinkAngle))));
      horLinkPoints[3].Y = (int16_t)(horLinkPoints[0].Y + (82.5*sinf(deg2rad(horLinkAngle))));
      horLinkPoints[2].X = horLinkPoints[3].X;
      horLinkPoints[2].Y = horLinkPoints[3].Y + 10; 
        
      BSP_LCD_FillRect(30, 250, 40, 40);
      BSP_LCD_FillPolygon(verLinkPoints, 4);
      BSP_LCD_FillPolygon(horLinkPoints, 4);
      BSP_LCD_FillRect(horLinkPoints[3].X, horLinkPoints[3].Y, 30, 10);
      
      BSP_LCD_FillCircle(50,250,10);
      BSP_LCD_FillCircle(verLinkPoints[3].X+5,verLinkPoints[3].Y+5,10);
      BSP_LCD_FillCircle(horLinkPoints[3].X,horLinkPoints[3].Y+5,10);
      BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
      BSP_LCD_FillCircle(50,250,5);
      BSP_LCD_FillCircle(verLinkPoints[3].X+5,verLinkPoints[3].Y+5,5);
      BSP_LCD_FillCircle(horLinkPoints[3].X,horLinkPoints[3].Y+5,5);
      BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
      
      if (turnAngle < -0.1){
        sprintf(textBuf, "   %.1f ->",  (turnAngle*-1));
      }
      else if (turnAngle > 0.1){
        sprintf(textBuf, "<- %.1f",  turnAngle);
      }
      else {
        sprintf(textBuf, "   %.1f",  turnAngle);
      }
      BSP_LCD_SetFont(&Font12);
      BSP_LCD_DisplayStringAt(15, 300, (unsigned char*) textBuf, LEFT_MODE);
      BSP_LCD_SetFont(&Font16);
    }
    
    
    
    osDelay(500);
  }
  /* USER CODE END 5 */ 
}

/* StartCommTask function */
void StartCommTask(void const * argument)
{
  /* USER CODE BEGIN StartCommTask */
  uint16_t Len = 0;
  //strcpy(txBuf, "echo: ");
  
  static int16_t turnValue = 100;
  static int16_t xPosValue = 100;
  static int16_t yPosValue = 100;
  static int16_t gripperValue = 100;

  static float xPoscm = 0;
  static float yPoscm = 0;
  
  static float targetStepSizeVar = 0.024; // 1 deg/s = 0.00588
  static float numberOfSteps = 0;

