dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
  static JointAngles finalJointAngles;
  
  //uint16_t servo1ComPosRef = 75;
  /* Infinite loop */
  for(;;)
  {

    if (receiveState == 1){

      if ( (rxBuf[0] == 'S') && (rxBuf[4] == ';') && (rxBuf[8] == ';') && (rxBuf[12] == ';') && (rxBuf[16] == '\r')) { // check the frame
      
        turnValue = (int16_t)((rxBuf[1]  - '0')*100 + (rxBuf[2]  - '0')*10 + (rxBuf[3]  - '0')*1);
        xPosValue = (int16_t)((rxBuf[5]  - '0')*100 + (rxBuf[6]  - '0')*10 + (rxBuf[7]  - '0')*1);
        yPosValue = (int16_t)((rxBuf[9]  - '0')*100 + (rxBuf[10]  - '0')*10 + (rxBuf[11]  - '0')*1);
        gripperValue = (int16_t)((rxBuf[13]  - '0')*100 + (rxBuf[14]  - '0')*10 + (rxBuf[15]  - '0')*1);
          
        xPoscm = ((float)xPosValue)/10.0;
        yPoscm = (((float)yPosValue)-50)/10.0;
        
        if (cycleRepeat == 0){
        
          finalJointAngles = calculateInverseKinematics(xPoscm/100.0,yPoscm/100.0);
          servo3NewPosRef = deg2dc(finalJointAngles.joint1Angle);
          servo2NewPosRef = deg2dc(finalJointAngles.joint2angle);
          servo1NewPosRef = receivedTurn2dc(turnValue);
          servo4NewPosRef = receivedGrip2dc(gripperValue);
          
          if ((absfloat(servo3NewPosRef-servo3CurrPos) > absfloat(servo2NewPosRef-servo2CurrPos)) && (absfloat(servo3NewPosRef-servo3CurrPos) > absfloat(servo1NewPosRef-servo1CurrPos))){
            servo3StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo3NewPosRef-servo3CurrPos)/targetStepSizeVar;
            servo2StepSize = absfloat(servo2NewPosRef-servo2CurrPos)/numberOfSteps;
            servo1StepSize = absfloat(servo1NewPosRef-servo1CurrPos)/numberOfSteps;
          }
          else if ((absfloat(servo2NewPosRef-servo2CurrPos) > absfloat(servo3NewPosRef-servo3CurrPos)) && (absfloat(servo2NewPosRef-servo2CurrPos) > absfloat(servo1NewPosRef-servo1CurrPos))){
            servo2StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo2NewPosRef-servo2CurrPos)/targetStepSizeVar;
            servo3StepSize = absfloat(servo3NewPosRef-servo3CurrPos)/numberOfSteps;
            servo1StepSize = absfloat(servo1NewPosRef-servo1CurrPos)/numberOfSteps;
          }
          else{
            servo1StepSize = targetStepSizeVar;
            numberOfSteps = absfloat(servo1NewPosRef-servo1CurrPos)/targetStepSizeVar;
            servo3StepSize = absfloat(servo3NewPosRef-servo3CurrPos)/numberOfSteps;
            servo2StepSize = absfloat(servo2NewPosRef-servo2CurrPos)/numberOfSteps;
          }
        }
        
        sprintf(txBuf, "OK: %s\r", rxBuf);
        Len = SizeofCharArray((char*)txBuf);
        CDC_Transmit_HS((uint8_t*)txBuf, Len);
      }
      else{
        sprintf(txBuf, "ERR: %s\r", rxBuf);
        Len = SizeofCharArray((char*)txBuf);
        CDC_Transmit_HS((uint8_t*)txBuf, Len);
        
      }
      
      receiveState = 0;

    }
    osDelay(1000);
  }
  /* USER CODE END StartCommTask */
}

/* StartSensorTask function */
void StartSensorTask(void const * argument)
{
  /* USER CODE BEGIN StartSensorTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(10);
  }
  /* USER CODE END StartSensorTask */
}

/* StartControlTask function */
void StartControlTask(void const * argument)
{
  /* USER CODE BEGIN StartControlTask */
  /* Infinite loop */
  for(;;)
  {
    
    saturateFloat(&servo1NewPosRef, servo1Min, servo1Max);
    saturateFloat(&servo2NewPosRef, servo2Min, servo2Max);
    saturateFloat(&servo3NewPosRef, servo3Min, servo3Max);
    saturateFloat(&servo4NewPosRef, servo4Min, servo4Max);
    saturateFloat(&servo5NewPosRef, servo5Min, servo5Max);
    
    if (servo1NewPosRef > servo1CurrPos){
      if (servo1NewPosRef > servo1CurrPos + servo1StepSize){
        servo1NewPos = servo1CurrPos + servo1StepSize;
      }
      else{
        servo1NewPos = servo1NewPosRef;
      }
    }
    else if (servo1NewPosRef < servo1CurrPos){
      if (servo1NewPosRef < servo1CurrPos - servo1StepSize){
        servo1NewPos = servo1CurrPos - servo1StepSize;
      }
      else{
        servo1NewPos = servo1NewPosRef;
      }
    }
    
    if (servo2NewPosRef > servo2CurrPos){
      if (servo2NewPosRef > servo2CurrPos + servo2StepSize){
        servo2NewPos = servo2CurrPos + servo2StepSize;
      }
      else{
        servo2NewPos = servo2NewPosRef;
      }
    }
    else if (servo2NewPosRef < servo2CurrPos){
      if (servo2NewPosRef < servo2CurrPos - servo2StepSize){
        servo2NewPos = servo2CurrPos - servo2StepSize;
      }
      else{
        servo2NewPos = servo2NewPosRef;
      }
    }
    
    if (servo3NewPosRef > servo3CurrPos){
      if (servo3NewPosRef > servo3CurrPos + servo3StepSize){
        servo3NewPos = servo3CurrPos + servo3StepSize;
      }
      else{
        servo3NewPos = servo3NewPosRef;
      }
    }
    else if (servo3NewPosRef < servo3CurrPos){
      if (servo3NewPosRef < servo3CurrPos - servo3StepSize){
        servo3NewPos = servo3CurrPos - servo3StepSize;
      }
      else{
        servo3NewPos = servo3NewPosRef;
      }
    }
    
    if (servo4NewPosRef > servo4CurrPos){
      if (servo4NewPosRef > servo4CurrPos + servo4StepSize){
        servo4NewPos = servo4CurrPos + servo4StepSize;
      }
      else{
        servo4NewPos = servo4NewPosRef;
      }
    }
    else if (servo4NewPosRef < servo4CurrPos){
      if (servo4NewPosRef < servo4CurrPos - servo4StepSize){
        servo4NewPos = servo4CurrPos - servo4StepSize;
      }
      else{
        servo4NewPos = servo4NewPosRef;
      }
    }
    
    if (servo5NewPosRef > servo5CurrPos){
      if (servo5NewPosRef > servo5CurrPos + servo5StepSize){
        servo5NewPos = servo5CurrPos + servo5StepSize;
      }
      else{
        servo5NewPos = servo5NewPosRef;
      }
    }
    else if (servo5NewPosRef < servo5CurrPos){
      if (servo5NewPosRef < servo5CurrPos - servo5StepSize){
        servo5NewPos = servo5CurrPos - servo5StepSize;
      }
      else{
        servo5NewPos = servo5NewPosRef;
      }
    }
    
    TIM2->CCR1 = (int)(servo1NewPos*120000/100);//7.5 = 1.5ms
    TIM2->CCR2 = (int)(servo2NewPos*120000/100);//10 = 2ms
    TIM3->CCR1 = (int)(servo3NewPos*120000/100);//5 = 1ms
    TIM3->CCR3 = (int)(servo4NewPos*120000/100);
    TIM4->CCR2 = (int)(servo5NewPos*120000/100);
    
    servo1CurrPos = servo1NewPos;
    servo2CurrPos = servo2NewPos;
    servo3CurrPos = servo3NewPos;
    servo4CurrPos = servo4NewPos;
    servo5CurrPos = servo5NewPos;
    
    osDelay(10);
  }
  /* USER CODE END StartControlTask */
}

/* StartServoRampTask function */
void StartServoRampTask(void const * argument)
{
  /* USER CODE BEGIN StartServoRampTask */
  int taskCounter = 0;
  int taskDelay = 1000;
  /* Infinite loop */
  for(;;)
  {
    if (mode % 2 == 1) {
      if (taskCounter % 2 == 0){
        servo2NewPosRef = 8;
        servo3NewPosRef = 6.8;
      }
      else{
        servo2NewPosRef = 10;
        servo3NewPosRef = 6.8;
      }
      taskCounter++;
      osDelay(500);
    }
    else if (cycleRepeat == 1){
      if (taskCounter % 12 == 0){
        servo3NewPosRef = 6.8;
        servo4NewPosRef = 6;
        servo1StepSize = 0.03;
        taskDelay = 1000;
      }
      else if (taskCounter % 12 == 1){
        servo2NewPosRef = 9;
        taskDelay = 1000;
      }
      else if (taskCounter % 12 == 2){
        servo1NewPosRef = 7.5;
        taskDelay = 2000;
      }
      else if (taskCounter % 12 == 3){
        servo1NewPosRef = 3;
        servo2NewPosRef = 7.5;
        taskDelay = 2000;
      }
      else if (taskCounter % 12 == 4){
        
