dudasdavid/RobotArm2k17/STM32F4/RobotArm/Src/main.c
        servo3NewPosRef = 9.25;
        taskDelay = 1500;
      }
      else if (taskCounter % 12 == 5){
        servo4NewPosRef = 9.2;
        taskDelay = 1500;
      }
      else if (taskCounter % 12 == 6){
        servo1NewPosRef = 7.5;
        servo2NewPosRef = 10.7;
        servo3NewPosRef = 6.8;
        servo2StepSize = 0.03;
        servo3StepSize = 0.03;
        taskDelay = 2500;
      }
      else if (taskCounter % 12 == 7){
        servo2NewPosRef = 10.7;
        servo3NewPosRef = 8;
        servo2StepSize = 0.03;
        taskDelay = 500;
      }
      else if (taskCounter % 12 == 8){
        servo2NewPosRef = 10.7;
        servo3NewPosRef = 6.8;
        taskDelay = 1000;
      }
      else if (taskCounter % 12 == 9){
        servo1NewPosRef = 3;
        servo2NewPosRef = 7.5;
        servo2StepSize = 0.03;
        taskDelay = 2000;
      }
      else if (taskCounter % 12 == 10){
        servo3NewPosRef = 9.25;
        taskDelay = 1500;
      }
      else if (taskCounter % 12 == 11){
        servo2StepSize = 0.03;
        servo4NewPosRef = 6;
        taskDelay = 1500;
        taskDelay = 30000;
        //cycleRepeat = 0;
      }
      
      taskCounter++;
      osDelay(taskDelay);
    }
    else{
      osDelay(500);
    }
  }
  /* USER CODE END StartServoRampTask */
}

/* StartTsTask function */
void StartTsTask(void const * argument)
{
  /* USER CODE BEGIN StartTsTask */
  TS_StateTypeDef  State;
  static uint32_t x = 0, y = 0;
  /* Infinite loop */
  for(;;)
  {
    BSP_TS_GetState(&State);

    x = State.X;
    y = State.Y; 
    /*
    if (State.TouchDetected){
      BSP_LCD_DrawCircle(x,y,3);
      BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
      BSP_LCD_FillCircle(120, 160, 80);
    }
    else{
      BSP_LCD_SetTextColor(LCD_COLOR_RED);
      BSP_LCD_FillCircle(120, 160, 80);
    }
    */
    osDelay(10);
  }
  /* USER CODE END StartTsTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
